import React from 'react'
import ReactDOM from 'react-dom/client'
import {Router} from './Router.tsx'
import './index.scss'

ReactDOM.createRoot(document.getElementById('root')!).render(
  <React.StrictMode>
    <Router />
  </React.StrictMode>,
)


// при регистрация да се задейства фаербеиската функция за регистрация и да се създава първи документ с празни полета за симптоми 
// при логин се задейства фб логин функция събскрайбера отчита промяна на юзъра и задества функция от стора която да упдейтне данните за този юзър 
// съответно при  излизане когато събскрабъра засече че няма юзър да задейства функция от стора за логаут която ъпдейтва стора на празен .
// тъка после само ще се упдейтва вече създадения документ с нови симптоми .